select * from d_product;
update d_product set images='images/p01.png' where id=10;

insert into d_product values(0,'未来简史',62,'网上支付','免邮费','送货上门','7天无理由退换货',7,2000,'★人类未来面临的三大议题<br>进入21世纪后，曾经长期威胁人类生存、发展的瘟疫、饥荒和战争已经被攻克，智人面临着新的待办议题：永生不老、幸福快乐和成为具有“神性”的升级人类。<br>★人类将迎来第二次认知革命<br>如果说*次认知革命是因为智人的DNA起了一点小变化，让人类拥有了虚构的能力，创造了宗教、国家、企业等概念，使其成为地球的统治者。那么，未来算法和生物技术将带来人类的第二次认知革命，完成从智人到神人的物种进化。<br>★人类认知升级的三个知识公式<br>中世纪时期，人类获取的知识公式：知识=经文×逻辑。<br>想知道某个重要问题的答案，我们会阅读相关经文，再用逻辑来理解经文的确切含义。','[以色列］尤瓦尔·赫拉利',4,369,'9787508672069','2016-12-21','product/weilaijianjiefeature.jpg','product/weilaijianshi1.jpg#product/weilaijianshi2.jpg#product/weilaijianshi2.jpg','目录<br>
第1 章人类的新议题 1<br>
生物贫穷线 2<br>
看不见的舰队 5<br>
打破弱肉强食的“丛林法则” 13<br>
死亡的末日 18<br>
幸福快乐的权利 26<br>
地球的神 38<br>
可以请哪位踩个刹车吗？ 44<br>
知识的矛盾 49<br>
一段关于草坪的历史 52<br>
第一幕中出现的一把枪 58<br>
 <br>
第一部分智人征服世界<br>
第2 章人类世 65<br>
蛇的孩子 68<br>
祖先的需求 71<br>
生物也是算法 75<br>
农业交易 81<br>
五百年孤寂 87<br>
 <br>
第3 章人类的特殊之处 91<br>
谁怕达尔文？ 92<br>
为什么股票交易所没有意识？ 95<br>
生命的等式 99<br>
实验室大鼠的抑郁生活 109<br>
有自我意识的黑猩猩 112<br>
聪明的马 114<br>
革命万岁！ 119<br>
在色情与暴力之外 123<br>
意义的网 128<br>
大同世界 134<br>
 <br>
第二部分智人为世界赋予意义<br>
第4 章说书人 139<br>
纸上的生活 146<br>
神圣的经文 149<br>
但这就是有用 156<br>
 <br>
第5 章一对冤家 161<br>
细菌和恶魔 162<br>
如果遇见佛陀 166<br>
伪造上帝 169<br>
神圣教条 176<br>
猎巫行动 178<br>
 <br>
第6 章与“现代”的契约 181<br>
银行家与吸血蝙蝠有何不同？ 183<br>
奇迹般的大饼 186<br>
方舟综合征 191<br>
毫无意义的竞赛追逐 197<br>
 <br>
第7 章人文主义革命 201<br>
向内心探寻 202<br>
踏上绿野仙踪的黄砖路 215<br>
战争的真相 220<br>
人文主义的分裂 225<br>
贝多芬比查克·贝里更高级吗？ 234<br>
宗教的人文战争 238<br>
电力、基因学、伊斯兰激进主义 243<br>
 <br>
第三部分智人失去控制权<br>
第8 章实验室里的定时炸弹 255<br>
我是谁 263<br>
生命的意义 270<br>
 <br>
第9 章大分离 277<br>
无用的阶级 288<br>
87% 的可能性 297<br>
从神使到君主 309<br>
不平等的再升级 313<br>
 <br>
第10 章意识的海洋 319<br>
心智的差距 320<br>
我闻到恐惧的气味 326<br>
宇宙凭依的钉子 330<br>
 <br>
第11 章信数据得永生 335<br>
所有的权力都去了哪？ 340<br>
概括历史 344<br>
信息渴求自由 346<br>
记录、上传、分享！ 350<br>
认识你自己 352<br>
数据流里的一片涟漪 357<br>
图片来源 363<br>
致谢 366<br>
注释 369<br>',0,'2017-03-12',0,1,'从以知的历史和科学角度看待未来');

-----2-------
insert into d_product values(1,'爱的艺术',20,'网上支付','不免邮费','送货上门','7天无理由退换货',2,1000,'　　《爱的艺术》是德裔美籍心理学家和哲学家、法 兰克福学派重要成员艾·弗洛姆最著名的作品，自 1956年出版至今已被翻译成32种文字，在全世界畅销 不衰，被誉为当代爱的艺术理论专著最著名的作品。<br>
     在这本《爱的艺术》中，弗洛姆认为，爱情不是 一种与人的成熟程度无关，只需要投入身心的感情。<br>
    如果不努力发展自己的全部人格并以此达到一种创造 倾向性，那么每种爱的试图都会失败，如果没有爱他 人的能力，如果不能真正谦恭地、勇敢地、真诚地和 有纪律地爱他人，那么人们在自己的爱情生活中也永 远得不到满足。<br>
     弗洛姆进而提出，爱是一门艺术，要求想要掌握 这门艺术的人有这方面的知识并付出努力。在这里， 爱不仅仅是狭隘的男女爱情，也并非通过磨练增进技 巧即可获得。爱是人格整体的展现，要发展爱的能力 ，就需要努力发展自己的人格，并朝着有益的目标迈 进。','Erich Fromm',5,400,'9787532745159','2014-8-01',null,'product/aideyishu1.jpg#product/aideyishu2.png','前言
第一章  爱是一门艺术吗?<br>
第二章  爱情的理论<br>
  （一）爱情是对人类生存问题的回答<br>
  （二）父母和孩子之间的爱<br>
  （三）爱的对象<br>
    （1）博爱<br>
    （2）母爱<br>
    （3）性爱<br>
    （4）自爱<br>
    （5）神爱<br>
第三章  爱情及其在当代西方社会的衰亡<br>
第四章  爱的实践<br>
附录<br>
  艾里希·弗洛姆生命中的',1,'2017-02-12',0,1,'爱是什么，为什么我们需要爱');
  -------3----------
  insert into d_product values(2,'法治及其本土资源',33,'网上支付','不免邮费','送货上门','7天无理由退换货',3,80,'《法治及其本土资源》内容以交叉学科为背景，从浅近的社会法律问题入手，集中讨论了中国当代法律和法学一系列重要理论问题。例如：法律规避和法律多元、法律本土化、法律专业化、市场与法律的替代问题，以及法学研究方法论等。其学术背景涉及经济学、人类学、社会学、阐释学、语言哲学等。以力求从平易中展现法学与其他学科的不可分割的关系，创造性地把交叉学科的知识引入到中国的法学研究中来，并融合进中国法学。','苏力',6,555,'9787301250051','2015-01-01',null,'product/fazhi.jpg','第三版序<br>
修订版序<br>
序（赵晓力）<br>
什么是你的贡献？（自序）<br>
致 谢<br>
<br>
第一编 变法与法制<br>
变法、法治建设及其本土资源<br>
秋菊的困惑和山杠爷的悲剧<br>
附录：从文学艺术作品来研究法律与社会？<br>
法律规避和法律多元<br>
再论法律规避<br>
市场经济对立法的启示<br>
市场经济需要什么样的法律？<br>
市场经济形成中的犯罪违法现象<br>
<br>
第二编 司法制度研究<br>
论法律活动的专门化<br>
关于抗辩制改革<br>
《秋菊打官司》的官司、邱氏鼠药案和言论自由<br>
附录：关于贾桂花案件的几个民法问题<br>

第三编 法学研究的规范化<br>
法学研究的规范化、传统与本土化<br>
什么是法理学？<br>
读《走向权利的时代》<br>
读劳伦斯?却伯的《美国宪法》<br>
后现代思潮与中国法学和法制<br>
法学本科教育的研究和思考',2,'2016-02-12',0,1,'集中讨论当代法学和法学等问题');
----4------
 insert into d_product values(3,'C#入门经典',63,'网上支付','免邮费','送货上门','7天无理由退换货',1,534,'C# 6和VisualStudio 2015编程实战指南<br>
《C#入门经典》系列是屡获殊荣的C#名著和超级畅销书。*版的 C#入门经典(第7版) C# 6.0 Visual Studio2015 全面介绍使用C# 6和.NET Framework编写程序的基础知识，是编程新手的理想读物。这本分步讲解的实用教程从最基本的面向对象编程讲起，浓墨重彩地描述初学者最常用的工具，不要求读者具有任何编程经验。紧贴实用的示例使用Visual Studio 2015中的C#环境，涵盖微软为使C#更好兼容其他编程语言所做的*改进。本书呈现微软资深开发人员的专家级建议，将指导初学者立即上手编写Windows和Web应用程序。<br>
主要内容<br>
◆ 首先讲解编程基础知识，如变量、流控制、面向对象编程、类、函数、集合、比较和转换等<br>
◆ 重点介绍Visual Studio 2015中初学者喜欢的C#6开发环境，囊括所有*功能和语言改进<br>
◆ 包括云和Windows编程中级内容，涵盖数据库和XML<br>
◆ 揭密错误处理技术和调试过程','briupTest',1,235,'9787302444060','2016-08-01',null,'product/C1.jpg','目 录<br>
第Ⅰ部分 OOP 语言<br>
第1章 C#简介 3<br>
1.1 .NET Framework的含义 3<br>
1.1.1 .NET Framework的内容 4<br>
1.1.2 使用.NETFramework编写应用程序 4<br>
1.2 C#的含义 7<br>
1.2.1 用C#能编写什么样的应用程序 8<br>
1.2.2 本书中的C# 8<br>
1.3 Visual Studio 2015 8<br>
1.3.1 Visual Studio Express 2015产品 9<br>
1.3.2 解决方案 9<br>
1.4 本章要点 9<br>
第2章 编写C#程序 11',5,'2016-06-12',0,1,'C#的基本原理和操作');
----5------
insert into d_product values(4,'Java从入门到精通',73,'网上支付','免邮费','送货上门','7天无理由退换货',7,55,'   《Java从入门到精通（第4版）》全新改版本<br>
“软件开发视频大讲堂”丛书系清华社“视频大讲堂”重点大系之一。该大系包括多个子系列，每个子系列的图书在其同品种的图书中销售名列前茅，其中：
4个品种荣获“全行业优秀畅销品种”
1个品种荣获2012年清华大学出版社“专业畅销书”一等奖
绝大多数品种在“全国计算机零售图书排行榜”同品种排行中名列前茅
截至目前该大系累计销售超过55万册
该大系已成为近年来清华社计算机专业基础类零售图书*畅销的品牌之一
','苏力ddd',1,666,'9787302287568','2012-09-01','product/javafeature.jpg','product/java1.jpg','第1篇　基础知识<br>	

第1章　初识Java<br>	
视频讲解：34分钟	<br>
1.1　Java简介	<br>
1.1.1　什么是Java语言	<br>
1.1.2　Java的应用领域	<br>
1.1.3　Java的版本	<br>
1.1.4　怎样学好Java	<br>
1.1.5　JavaAPI文档<br>	
1.2　Java语言的特性	<br>
1.2.1　简单	<br>
1.2.2　面向对象',6,'2016-07-12',9,1,'java的基本语法和操作');
----6------
insert into d_product values(5,'Java核心技术',88,'网上支付','免邮费','送货上门','7天无理由退换货',3,123,'  　Java领域最有影响力和价值的著作之一，拥有20多年教学与研究经验的资深Java技术专家撰写（获Jolt大奖），与《Java编程思想》齐名，10余年全球畅销不衰，广受好评。第9版根据JavaSE7全面更新，同时修正了第8版中的不足，系统全面讲解Java语言的核心概念、语法、重要特性和开发方法，包含大量案例，实践性强。<br>
　　《Java核心技术·卷1：基础知识》共14章。第1章概述了Java语言与其他程序设计语言不同的性能；第2章讲解了如何下载和安装JDK及本书的程序示例；第3章介绍了变量、循环和简单的函数；第4章讲解了类和封装；第5章介绍了继承；第6章解释了接口和内部类；第7章概述了图形用户界面程序设计知识；第8章讨论AWT的事件模型；第9章探讨了SwingGUI工具箱；第10章讲解如何部署自己的应用程序或applet；第11章讨论异常处理；第12章概要介绍泛型程序设计；第13章讲解Java平台的集合框架；第14章介绍了多线程。本书最后还有一个附录，其中列出了Java语言的保留字。
','苏力test',7,343,'9787111445142','2014-01-01',null,'product/java2.jpg','译者序<br>
前言<br>
致谢<br>

第1章 Java程序设计概述<br>
1.1 Java程序设计平台<br>
1.2 Java“白皮书”的关键术语<br>
1.2.1 简单性<br>
1.2.2 面向对象<br>
1.2.3 网络技能<br>
1.2.4 健壮性<br>
1.2.5 安全性<br>
1.2.6 体系结构中立<br>
1.2.7 可移植性',6,'2016-07-12',3,3,'核心java阐述');
----7------
insert into d_product values(6,'Java编程思想',110,'网上支付','免邮费','送货上门','30天无理由退换货',3,444,' 《计算机科学丛书：Java编程思想（第4版）》赢得了全球程序员的广泛赞誉，即使是晦涩的概念，在BruceEckel的文字亲和力和小而直接的编程示例面前也会化解于无形。从Java的基础语法到高级特性（深入的面向对象概念、多线程、自动项目构建、单元测试和调试等），本书都能逐步指导你轻松掌握。<br>
　　从《计算机科学丛书：Java编程思想（第4版）》获得的各项大奖以及来自世界各地的读者评论中，不难看出这是一本经典之作。本书的作者拥有多年教学经验，对C、C 以及Java语言都有独到、深入的见解，以通俗易懂及小而直接的示例解释了一个个晦涩抽象的概念。本书共22章，包括操作符、控制执行流程、访问权限控制、复用类、多态、接口、通过异常处理错误、字符串、泛型、数组、容器深入研究、JavaI/O系统、枚举类型、并发以及图形化用户界面等内容。这些丰富的内容，包含了Java语言基础语法以及高级特性，适合各个层次的Java程序员阅读，同时也是高等院校讲授面向对象程序设计语言以及Java语言的好教材和参考书。<br>
　　《计算机科学丛书：Java编程思想（第4版）》特点：<br>
　　适合初学者与专业人员的经典的面向对象叙述方式，为更新的JavaSE5/6增加了新的示例和章节。<br>
　　测验框架显示程序输出。','Bruce Eckel',7,363,'9787111213826','2007-06-01',null,'product/javaB.jpg','读者评论<br>
前言<br>
简介<br>
第1章 对象导论<br>
1.1 抽象过程<br>
1.2 每个对象都有一个接口<br>
1.3 每个对象都提供服务<br>
1.4 被隐藏的具体实现<br>
1.5 复用具体实现<br>
1.6 继承<br>
1.6.1 “是一个”（is-a）与“像是一个”（is-like-a）关系<br>
1.7 伴随多态的可互换对象<br>
1.8 单根继承结构<br>
1.9 容器',6,'2016-09-15',12,1,'如何用面向对象的思想编程');
----8------

insert into d_product values(7,'Hadoop权威指南',80,'网上支付','免邮费','送货上门','30天无理由退换货',3,992,' 准备好释放数据的强大潜能了吗？借助于这本《Hadoop权威指南》，你将学习如何使用Apache Hadoop构建和维护稳定性高、伸缩性强的分布式系统。本书是为程序员写的，可帮助他们分析任何大小的数据集。本书同时也是为管理员写的，帮助他们了解如何设置和运行Hadoop集群。<br>
　　本书通过丰富的案例学习来解释Hadoop的幕后机理，阐述了Hadoop如何解决现实生活中的具体问题。第3版覆盖Hadoop的*动态，包括新增的MapReduce API，以及MapReduce 2及其灵活性更强的执行模型（YARN）。','Tom White',5,563,'9787302370857','2015-01-01','product/hadoopFeature.jpg','product/hadoop1.jpg#product/hadoop2.jpg','第1章 初识Hadoop<br>
1.1 数据！数据！<br>
1.2 数据的存储与分析<br>
1.3 相较于其他系统的优势<br>
1.3.1 关系型数据库管理系统<br>
1.3.2 网格计算<br>
1.3.3 志愿计算<br>
1.4 Hadoop发展简史<br>
1.5 Apache Hadoop和Hadoop生态系统<br>
1.6 Hadoop的发行版本<br>
1.6.1 本书包含的内容<br>
1.6.2 兼容性',7,'2017-04-15',15,1,'大数据hadoop对静态数据的处理');
----9------
insert into d_product values(8,'Spark最佳实践',88,'网上支付','免邮费','送货上门','30天无理由退换货',7,673,' 本书是Spark实战指南，全书共分8章。前4章介绍Spark的部署、工作机制和内核，后4章分别通过实战项目介绍Spark SQL、Spark Streaming、Spark GraphX和Spark MLib功能模块。此外，本书详细介绍了常见的实战问题，比如大数据环境下的配置设置、程序调优等。本书附带的一键安装脚本，更能为初学者提供很大帮助。','陈欢 林世飞',2,456,'9787115422286','2016-03-03',null,'product/scala.jpg','第1章 　Spark与大数据　　1<br>
1.1 　大数据的发展及现状　　1<br>
1.1.1 　大数据时代所面临的问题　　1<br>
1.1.2 　谷歌的大数据解决方案　　2<br>
1.1.3 　Hadoop生态系统　　3<br>
1.2 　Spark应时而生　　4<br>
1.2.1 　Spark的起源　　4<br>
1.2.2 　Spark的特点　　5<br>
1.2.3 　Spark的未来发展　　6<br>
第2章 　Spark基础　　8<br>
2.1 　Spark本地单机模式体验　　8<br>
2.1.1 　安装虚拟机　　8<br>
2.1.2 　安装JDK　　19<br>
2.1.3 　下载Spark预编译包　　21',7,'2017-04-17',34,1,'大数据对动态数据时时分析');
----10------
insert into d_product values(9,'C++',333,'货到付款','免邮费','送货上门','15天无理由退换货',3,867,'Essential skills made easy Written by Herb Schildt, the world.sleading programming author, this step-by-step book is ideal forfirst-time programmers or those new to C++. The modular approach ofthis series, including sample projects and progress checks, makesit easy to learn to use C++ at y','Schildt, Herbert',5,556,'Y9780072232158','2017-03-03','product/CT.jpg','images/list_p1.png',null,8,'2017-04-17',99,3,'C++语法和基本的使用');
 -----11----- 
 insert into d_product values(10,'C',333,'货到付款','免邮费','送货上门','15天无理由退换货',1,867,'Essential skills made easy Written by Herb Schildt, the world.sleading programming author, this step-by-step book is ideal forfirst-time programmers or those new to C++. The modular approach ofthis series, including sample projects and progress checks, makesit easy to learn to use C++ at y','Schildt, Herbert',5,556,'Y9780072232158','2017-03-03','product/CT.jpg','images/p01.png',null,8,'2017-04-17',99,3,'C语法和基本的使用');


